app/controllers/messages_controller.rb

INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at", "room_id") VALUES (?, ?, ?, ?, ?)  [["body", "asdsdsd"], ["user_id", 9], ["created_at", "2023-09-11 06:58:34.516272"], ["updated_at", "2023-09-11 06:58:34.516272"], ["room_id", 1]]
---
  def create
    message = current_user.messages.build(message_params)
    room_id = message_params[:room_id]

    if message.save