app/controllers/room_controller.rb

  def show_room
    @chat_room =Room.find_by(id: params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    title = params[:room][:title]
    is_private = params[:room][:is_private] == '1'
    @room = Room.create(title: title, created_by: current_user.id, is_private: is_private)
    member = Member.create(user_id: current_user.id, room_id: @room.id)
---
INSERT INTO "rooms" ("title", "created_by", "created_at", "updated_at", "is_private") VALUES (?, ?, ?, ?, ?)  [["title", "Room4"], ["created_by", 9], ["created_at", "2023-09-12 05:01:18.278085"], ["updated_at", "2023-09-12 05:01:18.278085"], ["is_private", 1]]
INSERT INTO "members" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 9], ["room_id", 6], ["created_at", "2023-09-12 10:26:09.710713"], ["updated_at", "2023-09-12 10:26:09.710713"]]
INSERT INTO "rooms" ("title", "created_by", "created_at", "updated_at", "is_private") VALUES (?, ?, ?, ?, ?)  [["title", "Room3"], ["created_by", 9], ["created_at", "2023-09-12 10:26:09.686416"], ["updated_at", "2023-09-12 10:26:09.686416"], ["is_private", 1]]

  def delete_chat_room
    room = Room.find_by(id: params[:room_id])
    if room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 5]]

  def add_member
    user = User.find_by(id: params[:user_id])
    member = Member.new(user_id: params[:user_id], room_id: params[:room_id])
    if member.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "members" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["room_id", 6], ["created_at", "2023-09-12 10:26:17.157447"], ["updated_at", "2023-09-12 10:26:17.157447"]]

  def remove_member
    user = User.find_by(id: params[:user_id])
    member = Member.find_by(user_id: params[:user_id], room_id: params[:room_id])
    if member.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "members".* FROM "members" WHERE "members"."user_id" = ? AND "members"."room_id" = ? LIMIT ?  [["user_id", 6], ["room_id", 4], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 14]]

  def leave_room
    member = Member.find_by(user_id: params[:id], room_id: params[:room_id])
    if member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."user_id" = ? AND "members"."room_id" = ? LIMIT ?  [["user_id", 6], ["room_id", 4], ["LIMIT", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 14]]