app/controllers/user_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "rooms"."id" FROM "rooms" INNER JOIN "members" ON "rooms"."id" = "members"."room_id" WHERE "members"."user_id" = ?  [["user_id", 9]]
---
  def show
    user = User.find_by(id: params[:id])
    @rooms = user.room
    @message = Message.new
    @messages = Message.custom_display
    @public_rooms = Room.except(@rooms).public_rooms
    @private_rooms = Room.except(@rooms).private_rooms
    @requested_ids = user.requests.pluck(:room_id)

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Nitish"], ["password_digest", "[FILTERED]"], ["created_at", "2023-09-07 09:27:31.835629"], ["updated_at", "2023-09-07 09:27:31.835629"]]
---
  def create
    user =  User.new(username: params[:name], password: params[:password])
    if user.save!

INSERT INTO "members" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["room_id", 4], ["created_at", "2023-09-12 08:16:42.670187"], ["updated_at", "2023-09-12 08:16:42.670187"]]
---
  def join_chat_room
    member = Member.new(user_id: params[:id], room_id: params[:room_id])
    if member.save